---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBarNominalDiameter
source: html/ba1fe117-b6d2-75ba-86dd-d52590724b36.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetBarNominalDiameter Method

Gets the nominal diameter of the Rebar.

## Syntax (C#)
```csharp
public double GetBarNominalDiameter()
```

## Returns
Returns the nominal diameter of the Rebar.